Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor
This class is used to export properties and files from the model assembly and drawings, for the purpose of the fabrication drawings service,
and potential other machine learning projects with assemblies as input.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.exportModelDataRootFolder
Root folder for the storage of the export files with model data.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.exportDrawingDataRootFolder
Root folder for the storage of the export files with drawing data.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.NumberOfUniqueAssemblies
The number of drawing assemblies that were exported in latest export.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.NumberOfOutdatedDrawings
The number of drawings that were not exported in latest export because they required update.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.#ctor(System.String)
Creates a new instance of the AssemblyDataExtractor class.
exportModelDataFolder: Main folder where data is to be stored. It is created if needs be.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.#ctor(System.String,System.String)
Creates a new instance of the AssemblyDataExtractor class.
exportModelDataFolder: Main folder where model data is to be stored. It is created if needs be.
exportDrawingDataFolder: Main folder where drawing data is to be stored. It is created if needs be.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.GetRootFolder
Get the root folder for the storage of the export files.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.GetConfigurationFilesFolder
Get the folder where the configuration files for extraction are stored.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.GetTemporaryFilesFolder
Get the folder where the intermediate files for extraction are stored.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.GetRawTokensFolder
Get the folder where the assembly objects report properties are stored.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.GetDrawingsDescriptionJsonFile
Get the filename where the drawings description is stored.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.CleanUpForZip
Delete any intermediate and configuration files that are not meant to be in the result zip of the root folder.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.ExtractDrawingData(System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.Guid,System.Guid}},System.Action{System.String})
Extract the attributes data for the given drawings.
newDrawingsGuids: The list of key-value pair DgGuid, drawingsGuid that should be extracted
logger: Callback to output error messages
Returns: True if the extraction was successful for at least one drawing, false otherwise

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.ExtractAssembliesData(System.Collections.Generic.IList{Tekla.Structures.Model.Assembly})
Extract the attributes data for the selected assemblies.

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.CheckExtractedDrawingData(System.String,System.Action{System.String})
Diagnose whether drawing data extraction worked successfully.
resultString: Return value from core extraction function
logger: Callback to output error messages
Throws System.InvalidOperationException: Thrown when extraction has failed
Returns: True if the extraction was successful for at least one drawing, false otherwise

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.CheckJsonContent(System.String,System.Action{System.String})
Diagnose whether drawing data extraction worked successfully.
jsonFilePath: Extracted drawings description file
logger: Callback to output error messages
Returns: True if the extraction was successful for at least one drawing, false otherwise

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.SanityCheckExtractedAssemblyData(System.Int32)
Diagnose whether drawing data extraction worked successfully.
numberOfAssemblies: Number of assemblies that were selected for extraction
Throws System.InvalidOperationException: Thrown when extraction has failed

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.ConvertTextFileFromLocalEncodingToUtf8(System.String)
Converts text file from local encoding to UTF-8
filePath: path to text file

Tekla.Structures.ModelInternal.FabricationDrawingsServiceExtractor.SplitToKeyValuePairs(System.String,System.String,System.String)
Splits the string into key-value pairs.
input: String to split
pairSeparator: Pair separation identifier
keyValueSeparator: Key-value separation identifier
Returns: Dictionary of key-value -pairs